Revit 2024 API
FamilyManager.SetParameterLocked Method
 For Conceptual Mass and Curtain Panel families, lock or unlock a dimension-driving parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void SetParameterLocked(
	FamilyParameter familyParameter,
	bool locked
)
Visual Basic
Public Sub SetParameterLocked ( _
	familyParameter As FamilyParameter, _
	locked As Boolean _
)
Visual C++
public:
void SetParameterLocked(
	FamilyParameter^ familyParameter,
	bool locked
)
Parameters
familyParameter
Type: Autodesk.Revit.DB.FamilyParameter
locked
Type: System.Boolean
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown if this family is not a Conceptual Mass or Curtain Panel family.
Autodesk.Revit.Exceptions.ArgumentException |  Thrown if the parameter is not lockable.
See Also
FamilyManager Class
Autodesk.Revit.DB Namespace